In [6]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [26]:
dataset = pd.read_csv(r"E:\ML\handle_categorical.csv")
print(dataset.head(10))

   EmployeeID      FullName  Department       Role   Salary  \
0           1      Ali Khan         NaN        NaN      NaN
1           2    Sara Ahmed         NaN        NaN      NaN
2           3   Hassan Raza         NaN    Manager  90000.0
3           4   Fatima Noor          IT  Executive  90000.0
4           5   Usman Tariq          HR    Manager  70000.0
5           6  Ayesha Saeed         NaN        NaN      NaN
6           7   Bilal Zafar   Marketing     Intern  50000.0
7           8   Hina Sheikh          IT    Manager  70000.0
8           9   Omar Farooq         NaN        NaN      NaN
9          10    Zara Iqbal  Operations  Executive  70000.0

                      Email         Phone    Address    HireDate    Status
0      ali.khan@company.com  032-43163773        NaN  2020-01-31       NaN
1    sara.ahmed@company.com  030-41146082        NaN  2020-02-29       NaN
2   hassan.raza@company.com  030-31739356  Islamabad  2020-03-31    Active
3   fatima.noor@company.com  031-29576703   Peshawar  2020-04-30       NaN
4   usman.tariq@company.com  031-82429249   Peshawar  2020-05-31  Resigned
5  ayesha.saeed@company.com  032-33705256        NaN  2020-06-30       NaN
6   bilal.zafar@company.com  033-87633091        NaN  2020-07-31  On Leave
7   hina.sheikh@company.com  030-65403796    Karachi  2020-08-31    Active
8   omar.farooq@company.com  033-33508102        NaN  2020-09-30       NaN
9    zara.iqbal@company.com  032-15853584  Islamabad  2020-10-31  Resigned

In [8]:
dataset.isnull().sum()

EmployeeID     0
FullName       0
Department     7
Role           6
Salary         8
Email          0
Phone          0
Address       12
HireDate       0
Status         8
dtype: int64

In [5]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmployeeID  20 non-null     int64
 1   FullName    20 non-null     object
 2   Department  13 non-null     object
 3   Role        14 non-null     object
 4   Salary      12 non-null     float64
 5   Email       20 non-null     object
 6   Phone       20 non-null     object
 7   Address     8 non-null      object
 8   HireDate    20 non-null     object
 9   Status      12 non-null     object
dtypes: float64(1), int64(1), object(8)
memory usage: 1.7+ KB

In [9]:
dataset.select_dtypes(include="float64").columns

Index(['Salary'], dtype='object')

In [10]:
from sklearn.impute import SimpleImputer

In [25]:
si = SimpleImputer(strategy="mean")
ar = si.fit_transform(dataset[['Salary']])

In [18]:
new_dataset = pd.DataFrame(ar,columns=dataset.select_dtypes(include="float64").columns)

In [19]:
new_dataset.isnull().sum()

Salary    0
dtype: int64

In [20]:
new_dataset

          Salary
0   73333.333333
1   73333.333333
2   90000.000000
3   90000.000000
4   70000.000000
5   73333.333333
6   50000.000000
7   70000.000000
8   73333.333333
9   70000.000000
10  80000.000000
11  73333.333333
12  50000.000000
13  80000.000000
14  70000.000000
15  73333.333333
16  80000.000000
17  73333.333333
18  80000.000000
19  73333.333333

In [21]:
# through mean we fill the missing data

In [23]:
dataset["Salary"].mean()

np.float64(73333.33333333333)